W3D4/polls_app/app/models/response.rb

  def self.record_response(user, answer_choice)
    Response.create!(user_id: user.id, answer_choice_id: answer_choice.id)
---
INSERT INTO "responses" ("user_id", "answer_choice_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 41], ["answer_choice_id", 36], ["created_at", "2019-06-27 21:22:57.074339"], ["updated_at", "2019-06-27 21:22:57.074339"]]

  def sibling_responses
    self.question.responses.where.not(id: self.id)
---
SELECT  "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]